# # a.增：
# # ⅰ.add（元素）
# s1 = {10,20,39,23,233,12,4,23}
# s1.add(78)
# print(s1)
#
# # ⅱ.update（可迭代对象）
#
# s1 = {10,20,39,23,233,12,4,23}
# s1.update((11,34))
# print(s1)

# b.删：
# ⅰ.remove（元素）：移除指定元素
s1 = {10,20,39,23,233,12,4,23}
s1.remove(10)
print(s1)
# ⅱ.discard（元素）：从集合中移除指定元素，不存在不报错
s1 = {10,20,39,23,233,12,4,23}
s1.discard(78)
print(s1)
# ⅲ.pop（）：移除任意一个元素
s1 = {10,20,39,23,233,12,4,23}
s1.pop()
print(s1)
# ⅳ.clear（）：清空集合
s1 = {10,20,39,23,233,12,4,23}
s1.clear()
print(s1)

# 查：由于集合没有下标，也不支持切片操作，所以集合不具备按位置访问的能力；成员运算符可以判断元素是否在集合中：in   not i
s1 = {10,20,39,23,233,12,4,23}
# print(s1[1])
print(20 in s1)