# a.并集（s1 | s2）：集合A与集合B去重合并
# s1 = {1,2,3,4,5,6,7}
# s2 = {5,6,7,8,9,10}
# s3 = s1 | s2
# print(s1)
# print(s2)
# print(s3)

# b.交集（s1 & s2）：集合A与集合B共同拥有的元素组成的集合
# s1 = {1,2,3,4,5,6,7}
# s2 = {5,6,7,8,9,10}
# s3 = s1 & s2
# print(s1)
# print(s2)
# print(s3)


# c.差集（s1 - s2）：集合A中不属于集合B的元素集合
s1 = {1,2,3,4,5,6,7}
s2 = {5,6,7,8,9,10}
s3 = s1 - s2
# s3 = s2 - s1
print(s1)
print(s2)
print(s3)

# d.对称差集（s1 ^ s2）：集合A与集合B交集以外的所有元素的集合

s1 = {1,2,3,4,5,6,7}
s2 = {5,6,7,8,9,10}
s3 = s1 ^ s2
print(s1)
print(s2)
print(s3)