# 定义有内容的字典
d1 = {'张三': 1, '李四': 2, '王五': 3}
print(type(d1))
print(d1)

d1 = {'张三': 1, '李四': 2, '王五': 3, '张三': 9}
print(type(d1))
print(d1)
# 定义空字典
d1 = {}
print(type(d1), d1)
d2 = dict()
print(type(d2), d1)

# 字典中的key必须是不可变的，但value可以是任意类型
d1 = {250: 1, '李四': 2, '王五': 3, '张三': 9}
d2 = {('抽烟', '喝酒'): 1, '李四': 2, '王五': 3, '张三': 9}
# 错误写法
# d2 = {['抽烟','喝酒']:1,'李四':2,'王五':3,'张三':9}
print(d1)
print(d2)

# 嵌套写法
student = {202601:{'张三': 1,'性别': '男'}, 202602:{'李四': 2,'性别': '男'}, 202603:{'王五': 3,'性别': '男'}}
print(student)
