# 查询
d1 = {'张三': 1, '李四': 2, '王五': 3}
# 直接取值，若键不存在则报错
result = d1['张三']
print(result)
# 安全取值：若键不存在，会返回默认值（没有默认值则返回None）
d1.get('张三')
print(d1)

# 新增
d1 = {'张三': 1, '李四': 2, '王五': 3}
d1['赵六'] = 4
print(d1)

# 修改
d1 = {'张三': 1, '李四': 2, '王五': 3}
d1['张三'] = -1
print(d1)

# 批量修改
d1.update({'李四': 4, '王五': 5})
print(d1)

# 删除指定key对应的键值对
d1 = {'张三': 1, '李四': 2, '王五': 3}
del d1['张三']
print(d1)
# 删除指定key对应的键值对，并返回这个key对应的值
d1 = {'张三': 1, '李四': 2, '王五': 3}
result = d1.pop('张三')
print(result)

# pop方法可以设置默认值
# 默认值可以保证：当要删除的key不存在的情况下，不报错，并返回默认值
result = d1.pop('张三','删除失败')
print(d1)
print(result)

# 清空字典
d1.clear()
print(d1)